# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
  - [232,120, 312,256, 600,560]  # P5/32

# YOLOv5 v6.0 backbonenanodet-plus-m
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [24, 3, 2,1]],
   [-1, 1, Pool, [3, 2,1]],
   [-1, 1, Shuffle_repeats, [116, 2, 2]],  # 2
   [-1, 1, Shuffle_repeats, [232, 2, 2]],  # 3
   [-1, 1, Shuffle_repeats, [464, 2, 2]],  # 4
#FPN
   [-1, 1, Conv, [96, 1, 1]],    #5
   [3,  1, Conv, [96, 1, 1]],
   [2,  1, Conv, [96, 1, 1]],    #7

    #top-down path
   [5,1 ,nn.Upsample,[None,2,'bilinear',True]],  #8
   [[-1,6],1 ,Concat,[1]],
   [-1, 1, GhostBlocks, [96,1,5]],

   [-1,1,nn.Upsample,[None,2,'bilinear',True]],  #11
   [[-1,7],1 ,Concat,[1]],
   [-1, 1, GhostBlocks, [96,1,5]],              #13     out

    #bottom-up path
   [-1,1,Conv,[96,5,2,2,96,LeakReLu]],          #14      review  group
   [-1,1,Conv,[96,1,1,0,1,LeakReLu]],

   [[-1,10],1,Concat,[1]],
   [-1,1,GhostBlocks,[96,1,5]],                  #17      out

   [-1,1,Conv,[96,5,1,2,96,LeakReLu]],          #18
   [-1,1,Conv,[96,1,1,0,1,LeakReLu]],

   [[-1,10],1,Concat,[1]],
   [-1,1,GhostBlocks,[96,1,5]],               #21     out

   [[-1,8],1,Add,[96,5,2]]                    #22     out
  ]

# YOLOv5 v6.0 head
head:
  [
#  [-1,2,DepthwiseConvModule,[96,5,1,2]],
#  [-1,1,Conv,[112,1,1,2]],
#
#  [-1,2,DepthwiseConvModule,[96,5,1,2]],
#  [-1,1,Conv,[112,1,1,2]],
#
#  [-1,2,DepthwiseConvModule,[96,5,1,2]],
#  [-1,1,Conv,[112,1,1,2]],
#
#  [-1,2,DepthwiseConvModule,[96,5,1,2]],      #review
#  [-1,1,Conv,[112,1,1,2]],
#
#    #aux head
#  [[1,2,3,4],1,SimpleConvHead,[80,192,192,4,[8, 16, 32, 64,LeakyReLU,7]]],  #review up
   [[13, 17, 21,22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
